In [2]:
import pandas as pd
import numpy as np

In [5]:
data = [{
        "Student": [{"Exam": 90, "Grade": "a"},
                    {"Exam": 99, "Grade": "b"},
                    {"Exam": 97, "Grade": "c"},
                   ],
        "Name": "Paras Jain"
        },
        {
        "Student": [{"Exam": 89, "Grade": "a"},
                    {"Exam": 80, "Grade": "b"}
                  ],
        "Name": "Chunky Pandey"
        }
       ]

# df = pd.DataFrame(data)
df = pd.json_normalize(data, "Student", ["Name"])
# exams = data[0]['Student'] + data[1]['Student']
# names = data[0]['Name'] + data[1]['Name']
# df = pd.DataFrame(exams)
df

   Exam Grade           Name
0    90     a     Paras Jain
1    99     b     Paras Jain
2    97     c     Paras Jain
3    89     a  Chunky Pandey
4    80     b  Chunky Pandey

In [6]:
data1 =  """Date;Event;Cost
    10/2/2011;Music;10000
    11/2/2011;Poetry;12000
    12/2/2011;Theatre;5000
    13/2/2011;Comedy;8000
    """

In [13]:
from io import StringIO
data_io = StringIO(data1)

# Read the CSV data into a DataFrame
df = pd.read_csv(data_io, delimiter=';')

# Remove leading/trailing whitespaces from column names
# df.columns = df.columns.str.strip()

# Print the DataFrame
print(df)

            Date    Event   Cost
0      10/2/2011    Music  10000
1      11/2/2011   Poetry  12000
2      12/2/2011  Theatre   5000
3      13/2/2011   Comedy   8000

In [15]:
d = data1.split(';')
d

['Date',
 'Event',
 'Cost\n    10/2/2011',
 'Music',
 '10000\n    11/2/2011',
 'Poetry',
 '12000\n    12/2/2011',
 'Theatre',
 '5000\n    13/2/2011',
 'Comedy',
 '8000\n    ']

In [32]:
d1 = [ i.strip() for i in d]
# d1 = [ i.split('\\n') for i in d]
print(d1)

['Date', 'Event', 'Cost\n    10/2/2011', 'Music', '10000\n    11/2/2011', 'Poetry', '12000\n    12/2/2011', 'Theatre', '5000\n    13/2/2011', 'Comedy', '8000']

In [40]:
d1 = [ i.split() for i in d]
d2 = [ i.split() for i in d]
print(d2)

[['Date'], ['Event'], ['Cost', '10/2/2011'], ['Music'], ['10000', '11/2/2011'], ['Poetry'], ['12000', '12/2/2011'], ['Theatre'], ['5000', '13/2/2011'], ['Comedy'], ['8000']]

In [20]:
date = [d1[i*3] for i in range(1,  int(len(d1)/3) ) ] 
event = [d1[i*3 + 1] for i in range(1, int(len(d1)/3) ) ] 
cost = [d1[i*3 + 2] for i in range(1, int(len(d1)/3) ) ] 
date

['Music', '12000\n    12/2/2011']

In [19]:
df = pd.DataFrame()
df['Date'] = date
df['Event'] = event
df['Cost'] = cost
df

                   Date                 Event                 Cost
0                 Music  10000\n    11/2/2011               Poetry
1  12000\n    12/2/2011               Theatre  5000\n    13/2/2011